In [17]:
import pandas as pd
import numpy as np
dataSet1 = {
    'name':['Roman','Setch','Ganga',np.nan],
    'country':['America','Canada','India','Japan'],
    'Salary':[15000,12000,18000,np.nan],
}
data = pd.DataFrame(dataSet1)
data.head()

    name  country   Salary
0  Roman  America  15000.0
1  Setch   Canada  12000.0
2  Ganga    India  18000.0
3    NaN    Japan      NaN

In [27]:
data1 = data.dropna(axis = 0,inplace = False)

In [26]:
data

    name  country   Salary
0  Roman  America  15000.0
1  Setch   Canada  12000.0
2  Ganga    India  18000.0
3    NaN    Japan      NaN

In [29]:
data1.to_numpy()

array([['Roman', 'America', 15000.0],
       ['Setch', 'Canada', 12000.0],
       ['Ganga', 'India', 18000.0]], dtype=object)